In [1]:
import pandas as pd

In [2]:
# read_csv()를 이용해서 csv 파일(아니어도 됨)을 DataFrame으로 로딩함
titanic_df = pd.read_csv('titanic_train.csv')
print('titanic 변수 type:', type(titanic_df))

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

In [3]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
dic1 = {'Name': ['Chulmin', 'Eunkyung','Jinwoong','Soobeom'],
        'Year': [2011, 2016, 2015, 2015],
        'Gender': ['Male', 'Female', 'Male', 'Male']
       }

# .DataFrame을 쓰면 딕셔너리가 DataFrame으로 변환됨. 다른거도 되기는 하는데 유의미하지는 않음
data_df = pd.DataFrame(dic1)
print(data_df)
print()

# columns를 재구성할수도 있다. 없는 컬럼은 NaN으로 뜬다. 
data_df = pd.DataFrame(dic1, columns=['Name', 'Year', 'Gender','Test1', 'Test2'])
print(data_df)
print()

# 인덱스를 새로운 값으로 할당할 수도 있다. 다만 모든 인덱스를 입력해줘야 한다. 
# 컬럼 개별의 데이터를 바꾸는건 여기단계에서는 안된다. 
data_df = pd.DataFrame(dic1, index=['하나', '둘', '셋', '넷'])
print(data_df)
print()

       Name  Year  Gender
0   Chulmin  2011    Male
1  Eunkyung  2016  Female
2  Jinwoong  2015    Male
3   Soobeom  2015    Male

       Name  Year  Gender Test1 Test2
0   Chulmin  2011    Male   NaN   NaN
1  Eunkyung  2016  Female   NaN   NaN
2  Jinwoong  2015    Male   NaN   NaN
3   Soobeom  2015    Male   NaN   NaN

        Name  Year  Gender
하나   Chulmin  2011    Male
둘   Eunkyung  2016  Female
셋   Jinwoong  2015    Male
넷    Soobeom  2015    Male

In [5]:
# 컬럼정보 보고 싶으면 .columns, 인덱스 전체 범위를 보려면 .index, 인덱스 값을 보려면 .index.values
print(titanic_df.columns)
print()
print(titanic_df.index)
print()
print(titanic_df.index.values)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

RangeIndex(start=0, stop=891, step=1)

[  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [6]:
# 컬럼은 리스트 형태로 넣어야 한다. 그리고 한개만 넣어야 한다. (즉, 두개이상 넣을거면 한개로 묶어서 넣어야 함(두겹))
# 리스트내에 한개 컬럼만 입력하면 Series 객체 변환
series = titanic_df['Name']
print(series.head(3), type(series))
print()

# 여러개를 입력하거나, 하나지만 [[]] 두겹이면 DataFrame 객체 변환
filtered_df = titanic_df[['Name', 'Age']]
print(filtered_df.head(3), type(filtered_df))

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
Name: Name, dtype: object <class 'pandas.core.series.Series'>

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0 <class 'pandas.core.frame.DataFrame'>

In [7]:
# shape은 튜플을 안쓴다
titanic_df.shape

(891, 12)

In [8]:
# info는 튜플을 쓰면 요약, 안쓰면 전체
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
# describe는 평균/표준편차/4분위 분포도 제공, 안쓰면 그냥 info가 나온다
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
# value_counts: 동일한 개별 데이터 값이 몇 건이 있는지, 그리고 Series 객체에서만 출력이 가능하다.  
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [11]:
# sort_values(), 디폴트가 오름차순(True)이고, by='컬럼명' 꼭 있어야 함
titanic_df.sort_values(by='Age', ascending=False)

# # 다중 정렬하고 싶으면 리스트로 만들어서 넣어라
titanic_df[['Name', 'Sex', 'Pclass']].sort_values(by=['Sex','Pclass'])

                                                  Name     Sex  Pclass
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female       1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female       1
11                            Bonnell, Miss. Elizabeth  female       1
31      Spencer, Mrs. William Augustus (Marie Eugenie)  female       1
52            Harper, Mrs. Henry Sleeper (Myna Haxtun)  female       1
..                                                 ...     ...     ...
877                               Petroff, Mr. Nedelio    male       3
878                                 Laleff, Mr. Kristo    male       3
881                                 Markun, Mr. Johann    male       3
884                             Sutehall, Mr. Henry Jr    male       3
890                                Dooley, Mr. Patrick    male       3

[891 rows x 3 columns]

In [29]:
# list, dict, ndarray -> DataFrame 
# 리스트나 ndarray는 column을 따로 명기하면서 DataFrame 생성
# dict는 이미 키:밸류 이기 대문에 키가 column으로 올라감

import numpy as np
import pandas as pd
col_name1=['col1']
list1 = [1,2,3]
array1 = np.array(list1)
print('array1 shape:', array1.shape)
print()

df_list1 = pd.DataFrame(list1, columns=col_name1)
print('1차원 리스트로 만든 DataFrame:\n', df_list1)
print()

df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1차원 ndarray로 만든 DataFrame:\n', df_array1)

array1 shape: (3,)

1차원 리스트로 만든 DataFrame:
    col1
0     1
1     2
2     3

1차원 ndarray로 만든 DataFrame:
    col1
0     1
1     2
2     3

In [36]:
# 2차원 실습
# 열 개수만큼 컬럼명이 필요함
col_name2=['col1', 'col2', 'col3']

# 2행x3열 형태의 리스트와 ndarray 생성 한 뒤 이를 DataFrame으로 변환
list2 = [[1,2,3], 
         [11,12,13]]
array2 = np.array(list2)
print('array2 shape:', array2.shape)

df_list2 = pd.DataFrame(list2, columns=col_name2)
print('2차원 리스트로 만든 DataFrame:\n', df_list2)

df_array1 = pd.DataFrame(array2, columns=col_name2)
print('2차원 ndarray로 만든 DataFrame:\n', df_list2)

array2 shape: (2, 3)
2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [37]:
# dict -> DataFrame
dict = {'col1':[1,11], 'col2':[2,22], 'col3':[3,33]}
df_dict = pd.DataFrame(dict)
print('Dict -> DataFrame:\n', df_dict)

Dict -> DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

In [39]:
# DataFrame -> ndarray
array3 = df_dict.values
print(type(array3), array3.shape, '\n', array3)

<class 'numpy.ndarray'> (2, 3)
 [[ 1  2  3]
 [11 22 33]]

In [54]:
# DataFrame -> list(values에 대해 리스트로 변환), dict
list3 = df_dict.values.tolist()
print(type(list3), list3)

# DataFrame -> dict(to_dict를 쓰는데, 안에 value들은 리스트로 만들어줘('list'))
dict3 = df_dict.to_dict('list')
print(type(dict3), '\n', dict3)

<class 'list'> [[1, 2, 3], [11, 22, 33]]
<class 'dict'>
 {'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

In [87]:
# DataFrame의 컬럼 데이터 셋 접근: [] 연산자로 해결
titanic_df['Age_0'] = 0
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [88]:
titanic_df['Age_by_10'] = titanic_df['Age'] * 10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

In [63]:
# 기존꺼 업데이트하고 싶으면 기존 컬럼을 쓰면 된다
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,520.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,680.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,560.0,1

In [81]:
# DataFrame 데이터 삭제
# axis 구분 중요(axis=0 이면 행, axis=1 이면 열을 지움)
# 지울 컬럼명, 축, inplace(True면 원본을 바꿈, False면 안바꿈(기본값)) 여부 정하기 
# titanic_df = pd.read_csv('titanic_train.csv')
# titanic_df['Age_0'] = 0
titanic_drop_df = titanic_df.drop('Age_0', axis=1)
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,260.0,1

In [89]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

In [90]:
# 여러개 삭제하려면 컬럼들을 리스트로 입력
drop_result = titanic_df.drop(['Age_0', 'Age_by_10', 'Family_No'], axis=1, inplace=True)
print(drop_result)
titanic_df.head(3)

None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [93]:
# axis=0 인 경우 위에서 아래방향으로 삭제됨(행방향)
titanic_df = pd.read_csv('titanic_train.csv')
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)

print('#### before axis=0 drop ####')
print(titanic_df.head(3))

titanic_df.drop([0,1,2], axis=0, inplace=True)

print('#### after axis=0 drop ####')
print(titanic_df.head(3))

#### before axis=0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
#### after axis=0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

In [95]:
titanic_df = pd.read_csv('titanic_train.csv')
# index 객체 추출
indexes = titanic_df.index
print(indexes)
# index 객체의 실제 값 변환
print(indexes.values)

RangeIndex(start=0, stop=891, step=1)
[  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [96]:
# index는 1차원 데이터임
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [97]:
# []를 이용하여 임의로 index 값을 변경할 수 없음
indexes[0] = 5

TypeError: Index does not support mutable operations

In [98]:
# index 자체는 연산에서 제외되고 식별용으로만 사용됨
series_fair = titanic_df['Fare']
series_fair.head(5)

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64

In [100]:
print('Fair Series max 값:', series_fair.max())
print('Fair Series sum 값:', series_fair.sum())
print('sum() series fair 값:', sum(series_fair))
print('Fair Series +3 값:\n', (series_fair+3).head(3))

Fair Series max 값: 512.3292
Fair Series sum 값: 28693.9493
sum() series fair 값: 28693.949299999967
Fair Series +3 값:
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

In [106]:
# reset_index(): 인덱스를 새롭게 숫자 형으로 할당
titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [104]:
titanic_reset_df.shape

(891, 13)

In [111]:
# series 형태에서 인덱스가 컬럼으로 추가되면 데이터프래임으로 변환됨
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts, type(value_counts))

new_value_counts = value_counts.reset_index()
print(new_value_counts, type(new_value_counts))

3    491
1    216
2    184
Name: Pclass, dtype: int64 <class 'pandas.core.series.Series'>
   index  Pclass
0      3     491
1      1     216
2      2     184 <class 'pandas.core.frame.DataFrame'>

In [5]:
# DataFrame의 [] 연산자, index는 쓰지말자
import pandas as pd
titanic_df = pd.read_csv('titanic_train.csv')
print(titanic_df['Pclass'].head(3))
print(titanic_df[['Survived', 'Pclass']].head(3))
print(titanic_df[0])

0    3
1    1
2    3
Name: Pclass, dtype: int64
   Survived  Pclass
0         0       3
1         1       1
2         1       3

KeyError: 0

In [6]:
# 슬라이싱이 안되는건 아닌데 헷갈림, 웬만하면 하지말자
print(titanic_df[0:2])

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1

   Parch     Ticket     Fare Cabin Embarked
0      0  A/5 21171   7.2500   NaN        S
1      0   PC 17599  71.2833   C85        C

In [7]:
# 이런식으로 [] 내에 불린 인덱싱을 하는 방식에 익숙해지자 
print(titanic_df[titanic_df['Pclass'] == 3].head(3))

   PassengerId  Survived  Pclass                      Name     Sex   Age  \
0            1         0       3   Braund, Mr. Owen Harris    male  22.0
2            3         1       3    Heikkinen, Miss. Laina  female  26.0
4            5         0       3  Allen, Mr. William Henry    male  35.0

   SibSp  Parch            Ticket   Fare Cabin Embarked
0      1      0         A/5 21171  7.250   NaN        S
2      0      0  STON/O2. 3101282  7.925   NaN        S
4      0      0            373450  8.050   NaN        S

In [9]:
data = {'Name': ['Ave', 'Bob', 'Caren', 'David'],
        'Year': [2001, 2002, 2003, 1996],
        'Gender': ['Female', 'Male', 'Female', 'Male']    
        }
data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

        Name  Year  Gender
one      Ave  2001  Female
two      Bob  2002    Male
three  Caren  2003  Female
four   David  1996    Male

In [10]:
data_df.head()

        Name  Year  Gender
one      Ave  2001  Female
two      Bob  2002    Male
three  Caren  2003  Female
four   David  1996    Male

In [18]:
# reset_index()로 새로운 숫자형 인덱스를 생성 + .rename이라는 함수로 컬럼명칭을 바꿔준다
data_df_reset = data_df.reset_index()
data_df_reset = data_df_reset.rename(columns={'index':'old_index'})

# 인덱스값을 변경할수도 있다. (위치는 안바뀜)
data_df_reset.index = data_df_reset.index+1
data_df_reset

  old_index   Name  Year  Gender
1       one    Ave  2001  Female
2       two    Bob  2002    Male
3     three  Caren  2003  Female
4      four  David  1996    Male

In [11]:
# iloc: 위치기반 연산자(그냥 컬럼(인덱스 포함) 빼고 행/열의 위치만 가지고 데이터를 추출)
data_df.iloc[0,0]

'Ave'

In [13]:
# 위치가 아닌 명칭을 입력하는 경우 에러 발생
data_df.iloc[0,'Name']
data_df.iloc['one',0]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [19]:
data_df_reset.head()

  old_index   Name  Year  Gender
1       one    Ave  2001  Female
2       two    Bob  2002    Male
3     three  Caren  2003  Female
4      four  David  1996    Male

In [20]:
data_df_reset.iloc[0,1]

'Ave'

In [21]:
# .loc(명칭기반)
data_df

        Name  Year  Gender
one      Ave  2001  Female
two      Bob  2002    Male
three  Caren  2003  Female
four   David  1996    Male

In [23]:
data_df.loc['one', 'Name']

'Ave'

In [24]:
data_df_reset

  old_index   Name  Year  Gender
1       one    Ave  2001  Female
2       two    Bob  2002    Male
3     three  Caren  2003  Female
4      four  David  1996    Male

In [25]:
# 1의 경우 인덱스 == 명칭 이므로 먹힌다. 
data_df_reset.loc[1, 'Name']

'Ave'

In [26]:
# 0은 인덱스번호에 없기 때문에 에러가 남
data_df_reset.loc[0, 'Name']

KeyError: 0

In [27]:
# 정리: ix는 없어졌음(무시), iloc는 위치기반, loc는 명칭기반(인덱스도 명칭이다)
data_df

        Name  Year  Gender
one      Ave  2001  Female
two      Bob  2002    Male
three  Caren  2003  Female
four   David  1996    Male

In [30]:
print(data_df.iloc[0:1, 0])
print()
print(data_df.loc['two', 'Gender'])

one    Ave
Name: Name, dtype: object

Male

In [31]:
# 불린 인덱싱, 조건문을 [] 안에 넣어서 필터 수행
titanic_df = pd.read_csv('titanic_train.csv')
titanic_boolean = titanic_df[titanic_df['Age']>60]
print(type(titanic_boolean), titanic_boolean)

<class 'pandas.core.frame.DataFrame'>      PassengerId  Survived  Pclass                                       Name  \
33            34         0       2                      Wheadon, Mr. Edward H
54            55         0       1             Ostby, Mr. Engelhart Cornelius
96            97         0       1                  Goldschmidt, Mr. George B
116          117         0       3                       Connors, Mr. Patrick
170          171         0       1                  Van der hoef, Mr. Wyckoff
252          253         0       1                  Stead, Mr. William Thomas
275          276         1       1          Andrews, Miss. Kornelia Theodosia
280          281         0       3                           Duane, Mr. Frank
326          327         0       3                  Nysveen, Mr. Johan Hansen
438          439         0       1                          Fortune, Mr. Mark
456          457         0       1                  Millet, Mr. Francis Davis
483          484         1       3                     Turkula, Mrs. (Hedwig)
493          494         0       1                    Artagaveytia, Mr. Ramon
545          546         0       1               Nicholson, Mr. Arthur Ernest
555          556         0       1                         Wright, Mr. George
570          571         1       2                         Harris, Mr. George
625          626         0       1                      Sutton, Mr. Frederick
630          631         1       1       Barkworth, Mr. Algernon Henry Wilson
672          673         0       2                Mitchell, Mr. Henry Michael
745          746         0       1               Crosby, Capt. Edward Gifford
829          830         1       1  Stone, Mrs. George Nelson (Martha Evelyn)
851          852         0       3                        Svensson, Mr. Johan

        Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33     male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54     male  65.0      0      1       113509   61.9792          B30        C
96     male  71.0      0      0     PC 17754   34.6542           A5        C
116    male  70.5      0      0       370369    7.7500          NaN        Q
170    male  61.0      0      0       111240   33.5000          B19        S
252    male  62.0      0      0       113514   26.5500          C87        S
275  female  63.0      1      0        13502   77.9583           D7        S
280    male  65.0      0      0       336439    7.7500          NaN        Q
326    male  61.0      0      0       345364    6.2375          NaN        S
438    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456    male  65.0      0      0        13509   26.5500          E38        S
483  female  63.0      0      0         4134    9.5875          NaN        S
493    male  71.0      0      0     PC 17609   49.5042          NaN        C
545    male  64.0      0      0          693   26.0000          NaN        S
555    male  62.0      0      0       113807   26.5500          NaN        S
570    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625    male  61.0      0      0        36963   32.3208          D50        S
630    male  80.0      0      0        27042   30.0000          A23        S
672    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829  female  62.0      0      0       113572   80.0000          B28      NaN
851    male  74.0      0      0       347060    7.7750          NaN        S

In [34]:
# 사용 예시 
titanic_df[titanic_df['Age']>60][['Name', 'Age']].head(3)
print()
titanic_df[['Name', 'Age']][titanic_df['Age']>60].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [37]:
# loc는 boolean 연산도 받아줌
titanic_df.loc[titanic_df['Age']>60, ['Name', 'Age']].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [41]:
titanic_df[(titanic_df['Age']>60) & (titanic_df['Pclass'] == 1) & (titanic_df['Sex'] == 'female')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

In [42]:
# Aggregation 함수(연산 함수라고 단순히 생각하자)
# count를 하면 NaN 값은 제외하고 결과를 출력
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [45]:
# default는 axis=0 이고 행방향으로 합침(보통 그럼), 그게 싫으면 axis=1 이런걸 두면 됨
titanic_df[['Age', 'Fare']].mean(axis=1)

0      14.62500
1      54.64165
2      16.96250
3      44.05000
4      21.52500
         ...
886    20.00000
887    24.50000
888    23.45000
889    28.00000
890    19.87500
Length: 891, dtype: float64

In [46]:
titanic_df[['Age', 'Fare']].sum(axis=0)

Age     21205.1700
Fare    28693.9493
dtype: float64

In [47]:
titanic_df[['Age', 'Fare']].count()

Age     714
Fare    891
dtype: int64

In [49]:
# groupby 함수, 피벗테이블 기준으로 왼쪽에 붙는 항목들이라고 생각하면 된다. 
# DataFrame에 groupby()를 호출하면 DataFrameGroupBy 객체를 반환
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby), '\n', titanic_groupby)

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
 <pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000244922B85E0>

In [53]:
# groupby객체에 Aggregation함수를 호출하여 groupby를 수행
titanic_groupby = titanic_df.groupby(by='Pclass').count()
titanic_groupby

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [56]:
print(type(titanic_groupby), '\n', titanic_groupby.shape, '\n', titanic_groupby.index)

<class 'pandas.core.frame.DataFrame'>
 (3, 11)
 Int64Index([1, 2, 3], dtype='int64', name='Pclass')

In [57]:
# 컬럼이 너무 많으면 필터랑 같이 섞어서 볼 수도 있다. 
titanic_groupby = titanic_df.groupby(by='Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [60]:
# 필터와 groupby 순서는 바뀌어도 되나, 필터를 먼저쓰는 경우, groupby에서 쓸 컬럼이 있어야 함
titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [61]:
# []에 Pclass가 있어야 함
titanic_df[['PassengerId', 'Survived']].groupby('Pclass').count()

KeyError: 'Pclass'

In [65]:
# 그리고 하나짜리 컬럼데이터를 보고 싶으면 value_counts()를 쓰자
titanic_df.groupby('Pclass')['Pclass'].count()
titanic_df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [66]:
# 여러개의 aggregation 함수를 쓰려면 .agg 넣고 쓰면된다. 
# 컬럼에대해 다중 함수를 적용
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [69]:
# 딕셔너리로 .agg(딕셔너리) 를 하면 컬럼별 원하는 함수를 쓸 수 있다
titanic_df.groupby('Pclass').agg({'Age': 'max', 'SibSp': 'sum', 'Fare':'mean'})

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

In [70]:
# Missing 데이터 처리하기
# isna() 메소드로 missing 데이터 확인, fillna()로 missing 데이터 대체하기
titanic_df.isna().head(3) # True인 항목들이 비어있다는 소리

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False

In [71]:
# sum을 통해 컬럼별 빈데이터 건수를 구할 수 있음. (count를 쓰면 걍 전체건이 나옴)
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [108]:
# inplace=False가 default이고 True를 해서 원본을 바꿔도 되겠지만, 
# False로 놓고 같은 변수를 리턴하는 식으로 해도 됨(다른 변수를 놓으면 해당 컬럼만 변해서)
titanic_df = pd.read_csv('titanic_train.csv')
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000', inplace=False)

titanic_df
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin            0
Embarked         2
dtype: int64

In [111]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [112]:
# apply lambda 식으로 데이터 가공
# 파이썬 lambda 기본
lambda_square = lambda x: x**2
print('3의 제곱:', lambda_square(3))

3의 제곱: 9

In [122]:
# 다중 변수에 적용하려면 map함수로 덮어주기 
a= [1,2,3]
squares = map(lambda x: x**2, a)
print(list(squares))

[1, 4, 9]

In [123]:
# 판다스에 apply lambda 적용시 
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x: len(x))
titanic_df[['Name', 'Name_len']].head(3)

                                                Name  Name_len
0                            Braund, Mr. Owen Harris        23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                             Heikkinen, Miss. Laina        22

In [126]:
# if ~ else 문 적용가능
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x: 'Child' if x<=15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(10)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child
8  27.000000       Adult
9  14.000000       Child

In [132]:
# 2중 if 문도 구현가능
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x: 'Child' if x<=15 else ('Adult' if x <=60 else 'Elder'))
titanic_df['Age_cat'].value_counts()

Adult    786
Child     83
Elder     22
Name: Age_cat, dtype: int64

In [133]:
# 조건식이 좀 많으면(4개이상) 함수만들어서 쓰자 
def get_category(age):
    cat=''
    if age<=5: cat = 'Baby'
    elif age<=12: cat = 'Child'
    elif age<=18: cat = 'Teenager'
    elif age<=25: cat = 'Student'
    elif age<=35: cat = 'Young Adult'
    elif age<=60: cat = 'Adult'
    else: cat = 'Elderly'
    
    return cat

titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x: get_category(x))
titanic_df[['Age', 'Age_cat']].head(10)

         Age      Age_cat
0  22.000000      Student
1  38.000000        Adult
2  26.000000  Young Adult
3  35.000000  Young Adult
4  35.000000  Young Adult
5  29.699118  Young Adult
6  54.000000        Adult
7   2.000000         Baby
8  27.000000  Young Adult
9  14.000000     Teenager